/**
 *
 * *Якщо імейл і пароль користувача збігаються, при сабміті зберігай дані з форми
 * *у локальне сховище і змінюй кнопку login на logout і роби поля введення
 * *недоступними для зміни.
 *
 * *Якщо введені дані не збігаються з потрібними даними, викликати аlert і
 * *повідомляти про помилку.
 *
 * *При перезавантаженні сторінки, якщо користувач залогінений, ми повинні бачити logout-кнопку
 * *та недоступні для зміни поля з даними користувача.
 *
 * *Клік по кнопці logout повертає все в початковий вигляд та видаляє дані користувача
 * *З локального сховища.
 *
 */

const SAVED_LOGIN_DATA = "SAVED_LOGIN_DATA";
const USER_DATA = {
  email: "user@mail.com",
  password: "secret",
};
